/* a-spot.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* a-spot.f
*/

form baccnt label "БАНК ПОКУПАЕТ (СЧЕТ)"
     saccnt label "БАНК ПРОДАЕТ  (СЧЕТ)"
     with frame opt.
