/* anu.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы
 * AUTHOR
        31/12/99 pragma
 * CHANGES
 */

/*anu.p*/
/* for connected with rkbbase*/
/*07-10-2011 Пропала из библиотеки, сделал CO&CI*/
/*30-05-2012 dmitriy - удалил из cvs и снова добавил, т.к. программа не попадала в откомпилированную библиотеку*/

{ptltrx.f}
pause 0.
hide frame aa.
run checanu.p.
pause 0.
