/* casher72a.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

form "Сумма" m-sumd at 28 m-sumk  skip
      "Остаток "  m-diff at 35
  header
  "----------------------------------------------------------------------"
  with frame ba row 19 column 0 1 down no-underline overlay.
