/* cifkat3.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* cifkat3.p
* Модуль
            Клиенты и их счета
* Назначение 
            Отчет - Текущие остатки по категории клиентов (III)
* Применение
            
* Вызов 
            nmenu.p
* Меню 
            8.1.15.3
* Автор
            sasco
* Дата создания
            31.07.03
* Изменения
*/                                        


run cifkatrep ("3").

