/* gl-isvt11.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* GL-ISVT1.F
*/

/*"ACCNT# ACCOUNT TITLE                                       A M O U N T".*/
" Г/К        НАИМЕНОВАНИЕ                                 С У М М А    ".
