/* h-lon.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

&flddisp = "lon.lon    label 'Номер кредита'
            lon.cif    label 'Клиент'
            lon.rdt    label 'Дата рег.'
            lon.dam[1] label 'Дебет 1'
            lon.cam[1] label 'Кредит 1' "
