/* kdaffil.p   Электронное кредитное досье
 * MODULE
        Кредитное досье
 * DESCRIPTION
       ИНФОРМАЦИЯ ОБ АФФИЛИИРОВАННОЙ КОМПАНИИ
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        4-11-2 Аффилир
 * AUTHOR
        01.03.05 mairnav - основная программа вынесена в kdaffil.i
*/
   



{global.i}
{kd.i}

{kdaffil.i kdaffil kdcif true true pksysc}

