/* lnpro_r2.p
 * MODULE
        Потребительское кредитование
 * DESCRIPTION
        Пролонгация экспресс-кредита (вступает в силу с 01.04.2010), для ДМиВК
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Пункт меню
 * AUTHOR
        13/04/2010 madiyar
 * BASES
        BANK COMM
 * CHANGES
*/

run lnpro(/* ДКА */ yes, /* Только просмотр */ yes).

