/*lnpriv6.p
 * MODULE
        Название модуля
 * DESCRIPTION
         Справочник организаций со спецусловиями кредитования для кредитов типа 6 (Стандартный)
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Пункт меню
 * AUTHOR
        19/09/2008 galina
 * BASES
        BANK
 * CHANGES
*/

run lnpriv("6").