/* oficor1.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/***************************************************************************\
*****************************************************************************
**  Program: oficor1.p
**       By: nadejda 30.10.2002
** Descript: отчет о правах доступа по логину текущего офицера
**
*****************************************************************************
\***************************************************************************/

def shared var g-ofc like ofc.ofc.

displ "  Ждите...  " with row 5 centered title "" frame vv.
run oficor0(g-ofc).
pause 0.
hide frame vv no-pause.
run menu-prt("rpt.img").
pause 0.

