/* p-trarp.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/


define variable array-a as character extent 8 initial
    ["ВХОДЯЩИЙ ОСТАТОK   ТЕНГЕ   ",
     "ВХОДЯЩИЙ ОСТАТОК           ",
     "ИСХОДЯЩИЙ ОСТАТОК          ",
     "ИСХОДЯЩИЙ ОСТАТОК  ТЕНГЕ   ",
     "ОБОРОТЫ     (ДЕБЕТ )       ",
     "ОБОРОТЫ     (КРЕДИТ )      ",
     "ОБОР.ЗА  ПЕР. (ДЕБЕТ ) KZT ",
     "ОБОР.ЗА  ПЕР. (КРЕДИТ )KZT " ].
