/* r-gltvt2.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы
 * AUTHOR
        31/12/99 pragma
 * CHANGES
 21.01.2011 Luiza уменьшила ширину поля примечание.
*/

/* r-gltvt.f
*/
/*
"Control#           Debit          Credit            REMARKS[1]
                                              UPDT BY".
*/
/*"ТРАНЗАКЦИЯ         ДЕБЕТ          КРЕДИТ            ПРИМЕЧАНИЕ
                                     ОТВЕТИСПОЛНИТЕЛЬ". */
"ТРАНЗАКЦИЯ              ДЕБЕТ                КРЕДИТ                  ПРИМЕЧАНИЕ                          ОТВЕТИСПОЛНИТЕЛЬ".