/* rmzmon1.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
        15.10.2003 nadejda  - убрала определения, задала использование rmzmont.i
        05.01.2005 tsoy  - перекомпиляция

*/

/* KOVAL Это делал */

{get-dep.i} 
{global.i}


{rmzmont.i}

{rmzmon.i}


