/* s-lntr_2.p
 * MODULE
        Работа с кредитом
 * DESCRIPTION
        Погашение кредита (только просмотр, без совершения проводок)
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Пункт меню
 * AUTHOR
        07/10/2011 dmitriy
 * BASES
        BANK COMM
 * CHANGES

*/

run s-lontrx(/* do transaction */ no).

