/* s-lonsub1.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
        11.02.2004 nadejda - расширен формат для всех чисел
*/

/*------------------------------------------------------------------------------
  #1.4-1-1
  #7.Pievieno programmai s-lonsub.p
------------------------------------------------------------------------------*/
display
"        Кред.остат        Провиз.KZT        Получ. %          Начисл. %" skip
  "G"
   vyrst[1] format ">>>,>>>,>>>,>>>.99"
   vyrst[3] format ">,>>>,>>>,>>>.99"
   vyrst[2] format ">,>>>,>>>,>>>.99"
   vyrst[4] format ">>>,>>>,>>>,>>>.99-" skip
   "M"
   vmost[1] format ">>>,>>>,>>>,>>>.99"
   vmost[3] format ">,>>>,>>>,>>>.99"
   vmost[2] format ">,>>>,>>>,>>>.99"
   vmost[4] format ">>>,>>>,>>>,>>>.99-" skip
   "A"
   vcu[1]   format ">>>,>>>,>>>,>>>.99"
   vcu[3]   format ">,>>>,>>>,>>>.99"
   vcu[2]   format ">,>>>,>>>,>>>.99"
   vcu[4]   format ">>>,>>>,>>>,>>>.99-" skip
   "G - на начало года; M - на начало месяца; A - актуальн"
   with row 16 frame colhead no-box no-label centered.
