/* sdfn.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

 c1 = "ОБОРОТЫ ПО НОСТРО СЧЕТУ ".
 c2 = "ЗА ПЕРИОД  С  : ".
 c3 = "  ПО : ".
 c4 = " ДАТА     ОПЕР# ".
 c5 = "ДЕБЕТ ".
 c6 = "КРЕДИТ ".
 c7 = "ПРИМЕЧ.".
 c8 = " ВХ.ОСТАТКИ".
 c9 = "ИТОГО ДЕБЕТ".
 c10 = "ИТОГО КРЕДИТ".
 c11 = "ИСХ.ОСТАТКИ".
