/* TRNS_ps.p
 * MODULE
        Название модуля - Процесс платежной системы - код процесса TRNS.
 * DESCRIPTION
        Описание
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Процесс платежной системы - код процесса TRNS.
 * AUTHOR
        --/--/2011 damir
 * BASES
        BANK COMM
 * CHANGES
        03.04.2012 damir - записал все в программу transferbal.
*/

run transferbal.

