/* trtolat.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* TRTOLAT.P
 * Andrey Namiasenko
 * 20.12.94
 * перекодировка в латинский алфавит
 * для подготовки swift сообщения, т.е.
 * замена латышских/русских букв на подходящие латинские
 */

define input-output parameter in-s as char format "x(60)".

define variable inc         as int.
define variable ch          as int.
define variable ctable      as char extent 256 init [
/*      0    1    2    3    4    5    6    7    8    9    A    B    C    D    E    F*/
/*00*/ " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ",
/*10*/ " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ",
/*20*/ " ", " ", " ", " ", " ", " ", " ", "'", "(", ")", " ", "+", ",", "-", ".", "/",
/*30*/ "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", " ", " ", " ", " ", "?",
/*40*/ " ", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O",
/*50*/ "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", " ", " ", " ", " ", " ",
/*60*/ " ", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o",
/*70*/ "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", " ", " ", " ", " ", " ",
/*80*/ " ", " ", " ", " ", " ", "A", " ", "n", " ", " ", " ", " ", " ", " ", " ", " ",
/*90*/ " ", " ", " ", " ", " ", " ", "a", " ", " ", " ", " ", " ", " ", " ", " ", " ",
/*A0*/ "S", " ", "c", "e", " ", " ", "g", "I", "i", " ", " ", " ", " ", "u", "U", " ",
/*B0*/ "C", "k", "G", "E", "K", "l", "L", "z", "Z", "S", " ", " ", "N", "s", " ", " ",
/*C0*/ "u", "a", "b", "c", "d", "e", "f", "g", "h", "i", "i", "k", "l", "m", "n", "o",
/*D0*/ "p", "a", "r", "s", "t", "u", "g", "v", " ", "i", "z", "s", "e", "s", "c", " ",
/*E0*/ "U", "A", "B", "C", "D", "E", "F", "G", "H", "I", "I", "K", "L", "M", "N", "O",
/*F0*/ "P", "A", "R", "S", "T", "U", "G", "V", " ", "I", "Z", "S", "E", "S", "C", " "
].

do inc=1 to length(in-s):
    ch=asc(substr(in-s, inc, 1)).
    substr(in-s, inc, 1)=ctable[ch + 1].
end.
