/* vccard.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Приложения 7 - лицевая карточка клиента
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * BASES
         BANK COMM         
 * AUTHOR
        20.05.2008 galina
 * CHANGES
*/


{mainhead.i}

run vcrep7 ("this", 0, 'card').


