/* vcedcust.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* vcedcust.p Валютный контроль 
   Редактирование справочника таможенных органов для контрактов

   11.04.2003 nadejda создан
*/

{mainhead.i}

run vced ("КЛАССИФИКАТОР ТАМОЖЕННЫХ ОРГАНОВ", "customs").


