/* vcedtdoc.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* vcedtdoc.p Валютный контроль 
   Редактирование справочника видов документов

   18.10.2002 nadejda создан
*/

{mainhead.i VCEDTDOC}

run vced('ВИДЫ ДОКУМЕНТОВ', 'vctdoc').


