/* vcedcont.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* vcedcont.p Валютный контроль 
   Редактирование справочника типов контрактов

   18.10.2002 nadejda создан
*/

{mainhead.i VCEDCONT}

run vced('ТИПЫ КОНТРАКТОВ', 'vccontr').



