/* vcrepk5.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Приложение 5 - Информация по паспортам сделок и дополнительным листам к паспортам сделок (МТ111 для НБ)
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * BASES
         BANK COMM         
 * AUTHOR
        20.08.2008 galina
 * CHANGES
*/


{mainhead.i}

run vcrep5 ("all", 0, 'rep').

