/* vcrepdep.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* vcrepdep.p Валютный контроль
   Отчет по задолжникам на дату - отсутствуют ГТД - экспорт

   19.12.2002 nadejda создан
  
*/

{vc.i}

run vcrepdpl ("e").

