/* vcrepp4.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Приложение 4 - Формирование отчета Информация об исполнении обязательств по паспортам сделок
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * BASES
         BANK COMM         
 * AUTHOR
        06.05.2008 galina
 * CHANGES
*/


{mainhead.i}

run vcrep4.p ("this", 1, 'rep').
