/* vcrepk16.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* vcrepk16.p - Валютный контроль 
   Приложение 16 - лицевые карточки банковского контроля по импорту консолидированные

   18.06.2003 nadejda создана заглушка! отчета пока нет
*/

{mainhead.i}

/*run vcrep1516.*/


