/* vcrepa1.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Приложение 1 - все платежи за месяц по контрактам, где нет рег. свид-ва - по банку
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * BASES
         BANK COMM         
 * AUTHOR
        28.04.2008 galina
 * CHANGES
*/


{mainhead.i}

run vcrep1 ("this", 0).


