/* vcrepa18.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

/* vcrepa17.p - Валютный контроль 
   Приложение 17 - все платежи за месяц по контрактам по экспорту типа 2 - по банку

   19.11.2002 nadejda создан
*/

{mainhead.i}

run vcrep1718 ("i", "rep", "this", 0).

