/* vcrepp1.p
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Для Приложения 7 по департаменту
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * BASES
         BANK COMM         
 * AUTHOR
        16.05.2008 galina
 * CHANGES
*/


{mainhead.i}


run vcrep7 ("this", 1, 'rep').

