/* x-jlvou.f
 * MODULE
        Название Программного Модуля
 * DESCRIPTION
        Назначение программы, описание процедур и функций
 * RUN
        Способ вызова программы, описание параметров, примеры вызова
 * CALLER
        Список процедур, вызывающих этот файл
 * SCRIPT
        Список скриптов, вызывающих этот файл
 * INHERIT
        Список вызываемых процедур
 * MENU
        Перечень пунктов Меню Прагмы 
 * AUTHOR
        31/12/99 pragma
 * CHANGES
*/

vcha3 = "                                   ВСЕГО КРЕДИТ".
vcha2 = "                                   ВСЕГО ДЕБЕТ ".
find first cmp no-lock.
vcha1 = " " + cmp.name +  "          Операционный ордер      ".
